;;===================================================================================================
;;	File created by -bg- before	25/01/22	19:00	
;;	LAST UPDATED by RustyDios	25/01/22	22:30
;;
;;	EXPOSING THE UI STRINGS TO LOCALISATION
;;
;;===================================================================================================

;OLD BOX STYLE SCREEN
[UI_SelectSparkClasses]
ChooseTitle		= "创建 SPARK"
ChooseSubTitle	= "选择新职业"
ClassTitle		= "职业："
ClassSummary	= "摘要："
ChooseSPARK		= "SPARK"
ChooseLater		= "稍后"

;NEW CMC STYLE SCREEN
[UI_SelectSparkClasses_CMC]
m_strTitle			= "创建 SPARK"
m_strSubTitleTitle	= "选择新职业"

[X2EventListener_ArmoryMenu_CMCSParks]
strCMCMenuOption="晋升：编程SPARK"
strCMCTooltip="分配SPARK核心代码"
CMCListItemDescription="为这个SPARK选择一个职业，获得新的技能和能力。"

[XComGame.UIAlert]
[UISL_SPARKChooseClassInArmory]
m_strRefuseTitle = "未编程的SPARK单元"
m_strRefuseText = "这个SPARK单元需要使用自定义职业进行编程。\n该单元不能被选择参与战斗任务。\n\n请返回军械库并晋升该单元。"
